{"basics":{"name":"Eli McPherson","label":"Bioinformatician","picture":"https://example.com/photo.jpg","email":"eli.mcpherson@protonmail.ch","phone":"(760) 468-3354","website":"https://thomasedison.com","summary":"Bioinformatician with ten years of computational biology and in-lab biological development experience specializing in protein discovery and mapping. Passionate about tinkering and tuning code to balance computing resource utilization with appropriate hardware specifications for robust, accurate, scalable deliverables.","location":{"address":"","postalCode":"02145","city":"Somerville","countryCode":"US","region":"Massachusetts"},"profiles":[{"network":"LinkedIn","username":"elimcpherson","url":"https://www.linkedin.com/in/elimcpherson/"}],"url":"https://github.com/ECM893"},"work":[{"company":"Edison Electric Light Company","position":"Senior Engineer","website":"https://edison.com","startDate":"2024-08-01","endDate":"Present","summary":"In my current role as a bioinformatics consultant, I advise multiple clients on the technical direction of their drug discovery projects, architect machine learning algorithms to analyze multi-omics (e.g. RNASeq, protein abundance, enzyme activity) data pipelines, and use those pipelines to make protein property predictions.","highlights":["PDB","GO","STRING","Nextflow","Ray","PyTorch","scikit-learn","GPU high performance computing","Ray"],"name":"AI/ML Bioinformatics Consulting","location":"Boston, MA","description":"Propose, design, and implement bioinformatics drug target identification pipeline using PDB, GO, and STRING. Independently research viable methods of cell line and disease characterization for optimal client use cases. In one notable instance, identified RNAseq as the most financially viable assay methodology for client needs, and implemented large scRNAseq and bulkRNAseq dataset analysis using Nextflow, as well as associated preprocessing and differential expression analysis. Proposed, designed, and implemented automated neural net architecture (LLM and MLP) tuning, training, and production analysis repositories for a client using Ray, PyTorch, and Scikit-learn on GPUs, cutting down client’s generation of predictive algorithms from large biological datasets from weeks to minutes/hours and maximizing recommended biomolecule feature organisms for customers by 1000%."},{"company":"General Electric","position":"Student Researcher","website":"https://ge.com","startDate":"2023-09-01","endDate":"2024-08-31","summary":"For my Master's thesis, I worked in the Khalil lab to characterize the capabilities of a DIY bioreactor (eVOLVER) for luminescence detection in autonomous bioreactor control.","highlights":["Custom Python modules","ML algorithms","High-throughput automation integration","Directed evolution","Assay development","Fluorescence/luminescence detection"],"name":"Khalil Lab, Boston University","location":"Boston, MA","url":"https://www.bu.edu/khalillab/people.html"}],"volunteer":[{"organization":"Menlo Park Laboratory","position":"Lead Researcher","website":"https://menloparklab.com","startDate":"1876-01-01","endDate":"1931-10-18","summary":"Conducted research and experiments leading to numerous patents and innovations.","highlights":["Developed the phonograph, a device for recording and reproducing sound.","Invented the motion picture camera, contributing to the birth of the film industry."]}],"education":[{"institution":"Boston University","area":"Biomedical Engineering","studyType":"Master’s of Science","startDate":"2023-08-01","endDate":"2024-08-31","gpa":"","courses":[]}],"awards":[{"title":"Congressional Gold Medal","date":"1928-01-01","awarder":"United States Congress","summary":"Awarded for distinguished achievements and contributions to society."}],"publications":[{"name":"Luminescence detection in eVOLVER for autonomous bioreactor control.","publisher":"Boston University","releaseDate":"2024","website":"https://scientificamerican.com","summary":"We describe the design, implementation, and limitations of a luminescence detection system for the eVOLVER parallel benchtop bioreactor system. This addition aims to expand eVOLVER's functionality, particularly in Phage Assisted Continuous Evolution (PACE) platforms by allowing real-time automated feedback control of selection pressure in PACE.","url":"https://hdl.handle.net/2144/49235"}],"skills":[{"name":"Inventing","level":"Master","keywords":["Electricity","Sound Recording","Motion Pictures"]},{"name":"Entrepreneurship","level":"Expert","keywords":["Business Development","Product Innovation","Industrial Research"]}],"languages":[{"language":"English","fluency":"Native speaker"}],"interests":[{"name":"Research and Development","keywords":["Innovations","Experimentation"]}],"references":[{"name":"Henry Ford","reference":"Thomas Edison was a brilliant inventor and a visionary businessman. His work has had a profound impact on the modern world."}]}